# Day 11

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("https://github.com/datasciencedojo/datasets/blob/master/titanic.csv")

ParserError: Error tokenizing data. C error: Expected 1 fields in line 43, saw 73

In [ ]:
data = {'text':["gLFFefg","erDFgcs","eFGrgbs",'efvGFwd']}

In [ ]:
a = pd.DataFrame(data)

In [ ]:
a

      text
0  gLFFefg
1  erDFgcs
2  eFGrgbs
3  efvGFwd

In [ ]:
a['textLower'] = a['text'].str.lower()

In [ ]:
a

      text textLower
0  gLFFefg   glffefg
1  erDFgcs   erdfgcs
2  eFGrgbs   efgrgbs
3  efvGFwd   efvgfwd

In [ ]:
a['textUpper'] = a['text'].str.upper()

In [ ]:
a

      text textLower textUpper
0  gLFFefg   glffefg   GLFFEFG
1  erDFgcs   erdfgcs   ERDFGCS
2  eFGrgbs   efgrgbs   EFGRGBS
3  efvGFwd   efvgfwd   EFVGFWD

In [11]:
data = {'a':[1,1,3,4], 
        'b':[5,5,6,7],
        'c':['prashant','dhruv','harshit','piyush']}

In [12]:
df1 = pd.DataFrame(data)
df1

   a  b         c
0  1  5  prashant
1  1  5     dhruv
2  3  6   harshit
3  4  7    piyush

In [13]:
df1['mul_a'] = df1['a']*10

In [14]:
df1

   a  b         c  mul_a
0  1  5  prashant     10
1  1  5     dhruv     10
2  3  6   harshit     30
3  4  7    piyush     40

In [15]:
df1['a'].mean()

np.float64(2.25)

In [16]:
df1['b'].median()

np.float64(5.5)

In [17]:
df1['a'].mode()

0    1
Name: a, dtype: int64

In [18]:
df1['a'].min()

np.int64(1)

In [19]:
df1.a.max()

np.int64(4)

In [20]:
df1['b'].sum()

np.int64(23)

In [21]:
df1.a.std()

np.float64(1.5)

In [22]:
df1.a.var()

np.float64(2.25)

In [23]:
df1.a.dtype

dtype('int64')

In [24]:
df2 = {'a': ['1','2','55','3','7']}

In [26]:
df2 = pd.DataFrame(df2)
df2

    a
0   1
1   2
2  55
3   3
4   7

In [27]:
type(df2['a'])

pandas.core.series.Series

In [28]:
df2['a'].dtype

dtype('O')

In [30]:
df2['a_int'] = df2['a'].astype(int)

In [31]:
df2

    a  a_int
0   1      1
1   2      2
2  55     55
3   3      3
4   7      7

In [33]:
df2['a_int'].dtype

dtype('int64')

In [34]:
df3 = pd.DataFrame(df2)

In [36]:
df3.rolling(window=2).max()

      a  a_int
0   NaN    NaN
1   2.0    2.0
2  55.0   55.0
3  55.0   55.0
4   7.0    7.0

In [40]:
df3['Group'] = np.random.choice(['A','B'],size=5)

In [41]:
df3

    a  a_int Group
0   1      1     A
1   2      2     A
2  55     55     A
3   3      3     B
4   7      7     B

In [44]:
df3.groupby('Group')['a'].rolling(window=2).sum()

Group
A      0     NaN
       1     3.0
       2    57.0
B      3     NaN
       4    10.0
Name: a, dtype: float64

In [46]:
df3.groupby('Group')['a'].sum()

Group
A    1255
B      37
Name: a, dtype: object